package DZ_Modul__05_3_Mnogomernye_massivy;

Задание 8
Заполните n-мерный квадратный массив числами, кото-
рые увеличиваются на 1 по спирали (число n должно зада-
ваться с клавиатуры). Выведите результат на экран с соблю-
дением ширины столбцов. Для примера массив 4 на 4 должен 
выглядеть как указано в примере. 
Пример:
1 2 3 4
12 13 14 5
11 16 15 6
10 9 8 7
Дополнительно: выполнить задачу с использованием 
только одного цикла + 1 балл. 



public class Task_08 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
