package DZ_Modul__05_3_Mnogomernye_massivy;

Задание 10
В кинотеатре n рядов по m мест в каждом (m и n должно 
задаваться с клавиатуры). В двумерном массиве размерно-
стью m на n хранится информация о проданных билетах. 
Число 1 означает, что билет на данное место уже продан, 
число 0 означает, что место свободно. Поступил запрос на 
продажу k билетов на соседние места в одном ряду (k должно 
задаваться с клавиатуры).
Определите, можно ли выполнить такой запрос. Если ре-
шения есть, вывести номера рядов и номера свободных мест 
для продажи.
Число занятых мест и какие места заняты на момент за-
проса определите случайным образом. 
Вывести исходный массив на экран.


public class Task_10 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
