package DZ_Modul__05_3_Mnogomernye_massivy;

Задание 4 
Создать массив из 100 случайных чисел в диапазоне от 
- 300 до 555. Написать программу, копирующую один массив 
в другой следующим образом: сначала копируются последо-
вательно все элементы, большие 0, затем последовательно 
все элементы, равные 0, а затем последовательно все элемен-
ты, меньшие 0. Вывести исходный массив. Вывести резуль-
тирующий массив.


public class Task_04 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
