package DZ_Modul__05_3_Mnogomernye_massivy;

Задание 6 
Создать квадратный массив размерности n заполненный 
случайными числами, вывести массив на экран в виде та-
блицы, найти наименьший и наибольший элемент массива 
и вывести их на экран (если найдено несколько одинаковых 
элементов – вывести индексы строка и столбца, где есть по-
вторения). Вывести на экран время выполнения поиска, в 
миллисекундах. Размерность массива должна задаваться с 
клавиатуры.

public class Task_06 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
