package DZ_Modul__05_3_Mnogomernye_massivy;

Задание 12
Заполните квадратный массив размером n «ходом коня» 
– (конь в шахматах ходит буквой «Г»). Существует простой 
алгоритм, который позволяет гарантированно заполнить 
доску ходом коня размерами от 5 до 70. Т. е. сначала запол-
ните массив числом 0, а потом на первой клетке (элементе 
массива) ставится число 1, на следующей, на которую пры-
гает конь – 2 и так до тех пор, пока не останется клеток, на 
которые конь не ступал. Если остались нулевые значения 
– значит алгоритм работает не верно. Выведите массив на 
экран. Размерность массва должна задаваться с клавиатуры. 
(См. Задача о ходе коня).
Рекомендуется для решения данной задачи использовать 
правило Варнсдорфа. 


public class Task_12 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
