package DZ_Modul__05_3_Mnogomernye_massivy;


//	DZ_05_3
//		МНОГОМЕРНЫЕ МАССИВЫ
//			Задание 8
//				Заполните n-мерный квадратный массив числами, 
//				которые увеличиваются на 1 по спирали (число n должно 
//				задаваться с клавиатуры). Выведите результат на экран с 
//				соблюдением ширины столбцов. Для примера массив 4 на 4 должен 
//				выглядеть как указано в примере. 
//					Пример:
//						1 2 3 4
//						12 13 14 5
//						11 16 15 6
//						10 9 8 7
//							Дополнительно: выполнить задачу с использованием 
//							только одного цикла + 1 балл. 



public class Task_08 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
