package cikly;

import java.util.Scanner;

public class Task_10 {

	public static void main(String[] args) {
//		Домашнее задание No 4.1
//		Задание 10

    System.out.println("Введите положительное число: ");
    Scanner in = new Scanner(System.in);
    if(in.hasNextInt()) {
    	int number = in.nextInt();	
    
    }
    System.out.println("Конец программы!");	}

}
