package DZ_Modul__05_1_Stroki;

import java.util.Scanner;

//	Домашнее задание № 5.1
//		СТРОКИ
//			Задание 1 
//				Ввести с клавиатуры строку текста, а затем один символ. 
//				Показать на консоль индексы и количество совпадений (ищем 
//				вхождения символа в строку). В случае если совпадений не 
//				найдено, вывести соответствующий текст.

public class Task_01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		System.out.print("Введите любую строку текста:  ");
		Scanner sc = new Scanner(System.in);
		String str = sc.nextLine();
		System.out.print("Введите любую строку текста:  ");
		String oneChar = sc.next();
		sc.close();
		
		

	}

}
